{   
"projects" : [
    {
        "id"            : "crane",
        "title"         : "Crane Simulator",
        "categories"    : ["programming", "cad"],
        "bodytext"      : "This is a project I did over summer 2020 for a BU CS200 class taugh by XRTerra, with 2 classmates. We used the unity game engine to make the simulator, and most of the assets and all the scripting are done from scratch. I made all of the assets as well as some of the scripting and physics.<a href=\"https://github.com/elatorre20/Packet39-Crane-Simulator\">You can download the latest build as well as source code on my github.</a>",
        "imagetext"     : "<center><img src=\"/Images/Projects/CraneSim_Still.jpg\" alt=\"A picture of the environment in the crane simulator\" style=\"width:408px; height:230\"> <iframe width=\"408\" height=\"230\" src=\"https://www.youtube.com/embed/UfGrIEDFOaU\" alt=\"A video of the crane simulator in use.\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></center>"
    },
    {
        "id"            : "greenpower",
        "title"         : "F24 Greenpower Telemetry Board",
        "categories"    : ["programming", "electronics"],
        "bodytext"      : "In 2022, RICM began sponsoring several Rhode Island high schools in establishing a <a href = \"https://greenpowerusa.net/f24-grades-6-12\">Greenpower F24</a> electric gokart racing league. The primary purpose of the project is to give the students hands-on practice with fabrication, electronics, and mechanical engineering. The Greenpower foundation used to provide a <a href=\"https://www.greenpower.co.uk/product/340\">telemetry kit</a> which measured important statsitics about the car, but as it was very expensive and not available in the US, the museum asked me to design a replacement. Using the original kit as a guide for requirements, I selected parts, designed and ordered a board, and assembled a prototype kit. The kit measures car telemetry statistics like battery level, motor current consumption, motor temperature, and acceleration. We also added additional hardware to display statistics to the driver, and to log data to an SD card for the students to use in redesigning the car.",
        "imagetext"     : "<center><img src=\"/Images/Projects/Greenpower_Telemetry.jpg\" width=\"408\" height=\"auto\" alt=\"The F24 GreenPower telemetry\"></center>"
    }
]
}